In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
d = {'a':[1,2,3,4,5], 'b':[6, 7,8,9,np.nan], 'c': [0, 1, 2, np.nan, np.nan], 'd':[3, 4, np.nan,np.nan,np.nan], 'e': [5,np.nan,np.nan,np.nan,np.nan]}

In [4]:
d

{'a': [1, 2, 3, 4, 5],
 'b': [6, 7, 8, 9, nan],
 'c': [0, 1, 2, nan, nan],
 'd': [3, 4, nan, nan, nan],
 'e': [5, nan, nan, nan, nan]}

In [8]:
df = pd.DataFrame(d)

In [9]:
df

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0
1  2  7.0  1.0  4.0  NaN
2  3  8.0  2.0  NaN  NaN
3  4  9.0  NaN  NaN  NaN
4  5  NaN  NaN  NaN  NaN

In [12]:
df.dropna(axis=1)

   a
0  1
1  2
2  3
3  4
4  5

In [14]:
df.dropna()

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0

In [16]:
df.dropna(thresh = 1)

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0
1  2  7.0  1.0  4.0  NaN
2  3  8.0  2.0  NaN  NaN
3  4  9.0  NaN  NaN  NaN
4  5  NaN  NaN  NaN  NaN

In [18]:
df.fillna(1)

   a    b    c    d    e
0  1  6.0  0.0  3.0  5.0
1  2  7.0  1.0  4.0  1.0
2  3  8.0  2.0  1.0  1.0
3  4  9.0  1.0  1.0  1.0
4  5  1.0  1.0  1.0  1.0

In [25]:
df['b'].fillna(value = df['b'].mean())                 # average is replaced by the NaN or 1.0

0    6.0
1    7.0
2    8.0
3    9.0
4    7.5
Name: b, dtype: float64

In [27]:
df['c'].fillna(value = df['c'].mean())                 # average is replaced by the NaN or 1.0    # only for rows...

0    0.0
1    1.0
2    2.0
3    1.0
4    1.0
Name: c, dtype: float64

In [29]:
df['c'].fillna(value = df['b'].mean())                 # average is replaced by the NaN or 1.0
                                                        # can have average of any values; already filled values cannot get replaced

0    0.0
1    1.0
2    2.0
3    7.5
4    7.5
Name: c, dtype: float64